pub use crate::clBindings::clCommon::*;
pub use crate::clBindings::clIocApi::*;
/* automatically generated by rust-bindgen 0.66.1 */

pub const CL_CKPT_WR_ALL_REPLICAS: u32 = 1;
pub const CL_CKPT_WR_ACTIVE_REPLICA: u32 = 2;
pub const CL_CKPT_WR_ACTIVE_REPLICA_WEAK: u32 = 4;
pub const CL_CKPT_CHECKPOINT_COLLOCATED: u32 = 8;
pub const CL_CKPT_DISTRIBUTED: u32 = 16;
pub const CL_CKPT_WR_ALL_SAFE: u32 = 32;
pub const CL_CKPT_ALL_OPEN_ARE_REPLICAS: u32 = 64;
pub const CL_CKPT_PEER_TO_PEER_REPLICA: u32 = 128;
pub const CL_CKPT_PEER_TO_PEER_CACHE_DISABLE: u32 = 256;
pub const CL_CKPT_CHECKPOINT_READ: u32 = 1;
pub const CL_CKPT_CHECKPOINT_WRITE: u32 = 2;
pub const CL_CKPT_CHECKPOINT_CREATE: u32 = 4;
#[doc = " The type of the handle for the the checkpoint service library."]
pub type ClCkptSvcHdlT = ClHandleT;
#[doc = "  The handle used to identify a checkpoint."]
pub type ClCkptHdlT = ClHandleT;
#[doc = " The handle used to identify a section in a checkpoint."]
pub type ClCkptSecItrHdlT = ClHandleT;
#[doc = "  Flags to indicate various attributes of a checkpoint on creation."]
pub type ClCkptCreationFlagsT = ClUint32T;
#[doc = "  Flags to indicate open mode such as read, write or create."]
pub type ClCkptOpenFlagsT = ClUint32T;
#[doc = "  Selection object."]
pub type ClCkptSelectionObjT = ClUint32T;
#[doc = "  This structure represents the properties of checkpoint that can be specified during the creation process."]
#[repr(C)]
pub struct ClCkptCheckpointCreationAttributesT {
    #[doc = "  Create time attributes."]
    pub creationFlags: ClCkptCreationFlagsT,
    #[doc = "  Total size of application data in a replica."]
    pub checkpointSize: ClSizeT,
    #[doc = "  Checkpoint which is inactive (not opened anywhere) for this duration (in nanoseconds) is deleted."]
    pub retentionDuration: ClTimeT,
    #[doc = "  Maximum sections for this checkpoint."]
    pub maxSections: ClUint32T,
    #[doc = " Maximum size of a section."]
    pub maxSectionSize: ClSizeT,
    #[doc = "  Maximum length of the section identifier."]
    pub maxSectionIdSize: ClSizeT,
}
#[test]
fn bindgen_test_layout_ClCkptCheckpointCreationAttributesT() {
    const UNINIT: ::std::mem::MaybeUninit<ClCkptCheckpointCreationAttributesT> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ClCkptCheckpointCreationAttributesT>(),
        48usize,
        concat!("Size of: ", stringify!(ClCkptCheckpointCreationAttributesT))
    );
    assert_eq!(
        ::std::mem::align_of::<ClCkptCheckpointCreationAttributesT>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(ClCkptCheckpointCreationAttributesT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).creationFlags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCkptCheckpointCreationAttributesT),
            "::",
            stringify!(creationFlags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).checkpointSize) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCkptCheckpointCreationAttributesT),
            "::",
            stringify!(checkpointSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).retentionDuration) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCkptCheckpointCreationAttributesT),
            "::",
            stringify!(retentionDuration)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).maxSections) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCkptCheckpointCreationAttributesT),
            "::",
            stringify!(maxSections)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).maxSectionSize) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCkptCheckpointCreationAttributesT),
            "::",
            stringify!(maxSectionSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).maxSectionIdSize) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCkptCheckpointCreationAttributesT),
            "::",
            stringify!(maxSectionIdSize)
        )
    );
}
#[doc = "  This structure represents a section identifier."]
#[repr(C)]
pub struct ClCkptSectionIdT {
    #[doc = "  Length of the section identifier."]
    pub idLen: ClUint16T,
    #[doc = "  Section identifier."]
    pub id: *mut ClUint8T,
}
#[test]
fn bindgen_test_layout_ClCkptSectionIdT() {
    const UNINIT: ::std::mem::MaybeUninit<ClCkptSectionIdT> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ClCkptSectionIdT>(),
        16usize,
        concat!("Size of: ", stringify!(ClCkptSectionIdT))
    );
    assert_eq!(
        ::std::mem::align_of::<ClCkptSectionIdT>(),
        8usize,
        concat!("Alignment of ", stringify!(ClCkptSectionIdT))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).idLen) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCkptSectionIdT),
            "::",
            stringify!(idLen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCkptSectionIdT),
            "::",
            stringify!(id)
        )
    );
}
#[doc = "  This structure represents section attributes that can be specified during the creation process."]
#[repr(C)]
pub struct ClCkptSectionCreationAttributesT {
    #[doc = "  Section identifier."]
    pub sectionId: *mut ClCkptSectionIdT,
    #[doc = " Section expiration time."]
    pub expirationTime: ClTimeT,
}
#[test]
fn bindgen_test_layout_ClCkptSectionCreationAttributesT() {
    const UNINIT: ::std::mem::MaybeUninit<ClCkptSectionCreationAttributesT> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ClCkptSectionCreationAttributesT>(),
        16usize,
        concat!("Size of: ", stringify!(ClCkptSectionCreationAttributesT))
    );
    assert_eq!(
        ::std::mem::align_of::<ClCkptSectionCreationAttributesT>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(ClCkptSectionCreationAttributesT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sectionId) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCkptSectionCreationAttributesT),
            "::",
            stringify!(sectionId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).expirationTime) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCkptSectionCreationAttributesT),
            "::",
            stringify!(expirationTime)
        )
    );
}
#[doc = " Indicates that the section is fine."]
pub const ClCkptSectionStateT_CL_CKPT_SECTION_VALID: ClCkptSectionStateT = 1;
#[doc = "  Indicates that the section has been corrupted."]
pub const ClCkptSectionStateT_CL_CKPT_SECTION_CORRUPTED: ClCkptSectionStateT = 2;
#[doc = "  This enum represents the state of a section in a replica."]
pub type ClCkptSectionStateT = ::std::os::raw::c_uint;
#[doc = "  This structure represents a section in a checkpoint."]
#[repr(C)]
pub struct ClCkptSectionDescriptorT {
    #[doc = " Section identifier."]
    pub sectionId: ClCkptSectionIdT,
    #[doc = "  Expiration time for the section."]
    pub expirationTime: ClTimeT,
    #[doc = " Size of the section."]
    pub sectionSize: ClSizeT,
    #[doc = " Indicates whether a section has a valid or an invalid state."]
    pub sectionState: ClCkptSectionStateT,
    #[doc = "  Last time the section is updated."]
    pub lastUpdate: ClTimeT,
}
#[test]
fn bindgen_test_layout_ClCkptSectionDescriptorT() {
    const UNINIT: ::std::mem::MaybeUninit<ClCkptSectionDescriptorT> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ClCkptSectionDescriptorT>(),
        48usize,
        concat!("Size of: ", stringify!(ClCkptSectionDescriptorT))
    );
    assert_eq!(
        ::std::mem::align_of::<ClCkptSectionDescriptorT>(),
        8usize,
        concat!("Alignment of ", stringify!(ClCkptSectionDescriptorT))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sectionId) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCkptSectionDescriptorT),
            "::",
            stringify!(sectionId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).expirationTime) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCkptSectionDescriptorT),
            "::",
            stringify!(expirationTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sectionSize) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCkptSectionDescriptorT),
            "::",
            stringify!(sectionSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sectionState) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCkptSectionDescriptorT),
            "::",
            stringify!(sectionState)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lastUpdate) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCkptSectionDescriptorT),
            "::",
            stringify!(lastUpdate)
        )
    );
}
#[doc = " All sections with expiration time set to CL_TIME_END"]
pub const ClCkptSectionsChosenT_CL_CKPT_SECTIONS_FOREVER: ClCkptSectionsChosenT = 1;
#[doc = " All sections with expiration time less than or equal to the value\n of expirationTime."]
pub const ClCkptSectionsChosenT_CL_CKPT_SECTIONS_LEQ_EXPIRATION_TIME: ClCkptSectionsChosenT = 2;
#[doc = " All sections with expiration time greater than or equal to the value\n of expiration time"]
pub const ClCkptSectionsChosenT_CL_CKPT_SECTIONS_GEQ_EXPIRATION_TIME: ClCkptSectionsChosenT = 3;
#[doc = " All corrupted sections."]
pub const ClCkptSectionsChosenT_CL_CKPT_SECTIONS_CORRUPTED: ClCkptSectionsChosenT = 4;
#[doc = " All sections"]
pub const ClCkptSectionsChosenT_CL_CKPT_SECTIONS_ANY: ClCkptSectionsChosenT = 5;
#[doc = " This enum is used for selection of sections while iterating through all the sections."]
pub type ClCkptSectionsChosenT = ::std::os::raw::c_uint;
#[doc = " This structure represents an IO vector which will be used for dealing with more than zero sections."]
#[repr(C)]
pub struct ClCkptIOVectorElementT {
    #[doc = "  Identifier of the section."]
    pub sectionId: ClCkptSectionIdT,
    #[doc = "  Pointer to the data."]
    pub dataBuffer: ClPtrT,
    #[doc = " Size of the data."]
    pub dataSize: ClSizeT,
    #[doc = "  Offset."]
    pub dataOffset: ClOffsetT,
    #[doc = "  Number of bytes read."]
    pub readSize: ClSizeT,
}
#[test]
fn bindgen_test_layout_ClCkptIOVectorElementT() {
    const UNINIT: ::std::mem::MaybeUninit<ClCkptIOVectorElementT> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ClCkptIOVectorElementT>(),
        48usize,
        concat!("Size of: ", stringify!(ClCkptIOVectorElementT))
    );
    assert_eq!(
        ::std::mem::align_of::<ClCkptIOVectorElementT>(),
        8usize,
        concat!("Alignment of ", stringify!(ClCkptIOVectorElementT))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sectionId) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCkptIOVectorElementT),
            "::",
            stringify!(sectionId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dataBuffer) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCkptIOVectorElementT),
            "::",
            stringify!(dataBuffer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dataSize) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCkptIOVectorElementT),
            "::",
            stringify!(dataSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dataOffset) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCkptIOVectorElementT),
            "::",
            stringify!(dataOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).readSize) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCkptIOVectorElementT),
            "::",
            stringify!(readSize)
        )
    );
}
#[doc = "  This structure is used to describe a checkpoint."]
#[repr(C)]
pub struct ClCkptCheckpointDescriptorT {
    #[doc = "  Creates attribute."]
    pub checkpointCreationAttributes: ClCkptCheckpointCreationAttributesT,
    #[doc = "  Total number of sections."]
    pub numberOfSections: ClUint32T,
    #[doc = "  Memory used by the checkpoint."]
    pub memoryUsed: ClUint32T,
}
#[test]
fn bindgen_test_layout_ClCkptCheckpointDescriptorT() {
    const UNINIT: ::std::mem::MaybeUninit<ClCkptCheckpointDescriptorT> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ClCkptCheckpointDescriptorT>(),
        56usize,
        concat!("Size of: ", stringify!(ClCkptCheckpointDescriptorT))
    );
    assert_eq!(
        ::std::mem::align_of::<ClCkptCheckpointDescriptorT>(),
        8usize,
        concat!("Alignment of ", stringify!(ClCkptCheckpointDescriptorT))
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).checkpointCreationAttributes) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCkptCheckpointDescriptorT),
            "::",
            stringify!(checkpointCreationAttributes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numberOfSections) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCkptCheckpointDescriptorT),
            "::",
            stringify!(numberOfSections)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).memoryUsed) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCkptCheckpointDescriptorT),
            "::",
            stringify!(memoryUsed)
        )
    );
}
#[doc = "  \\brief This function gets called whenever a checkpoint is getting updated\n   on the local server. Provided the application has been registered for the\n   checkpoint update.\n\n  \\par Header File:\n  clCkptApi.h\n\n  \\param ckptHdl (in) Handle of the updated checkpoint.\n\n  \\param pName (in) Name of the checkpoint has been updated locally.\n\n  \\param pIoVector (in) List of updated sections and data of the checkpoint.\n\n  \\param numSections (in) Number of sections are being updated on this checkpoint.\n\n  \\param pCookie (in) Cookie which got from clCkptImmediateConsumptionRegister will be given back to\n                      application via this variable.\n\n  \\retval  CL_OK The Log stream is opened successfully.\n\n  \\retval  CL_ERR_TIMEOUT An implementation defined timeout occurred before the call\n  could complete.\n\n  \\retval  CL_ERR_NO_MEMORY Either the Ckpt Service library or some other module of\n  Ckpt Service is out of memory. Thus service can not be provided at this time. This\n  may be a transient problem.\n\n  \\par Description:\n  This notification callback is getting called, whenever the particular\n  checkpoint has been updated on the local server.This callback will be called\n  for whoever registers for the checkpoint update. Thie notication callback will be\n  registered through clCkptImmediateConsumptionRegister() call. This function carries\n  information about all updated sections and number of sections. This is mainly used\n  for HOT stanby applications on which the stanby application will be notified\n  immediately.\n\n  \\par Library File:\n  ClCkpt\n\n  \\sa clCkptImmediateConsumptionRegister\n"]
pub type ClCkptNotificationCallbackT = ::std::option::Option<
    unsafe extern "C" fn(
        ckptHdl: ClCkptHdlT,
        pName: *mut ClNameT,
        pIOVector: *mut ClCkptIOVectorElementT,
        numSections: ClUint32T,
        pCookie: ClPtrT,
    ) -> ClRcT,
>;
#[doc = "  \\brief This function gets called When clCkptCheckpointOpenAsync() call\n   returns on the server.\n\n  \\par Header File:\n  clCkptApi.h\n\n  \\param invocation (in) invocation value of the call. This is basically an\n  identification about the call.\n\n  \\param checkpointHandle (in) contains handle of the opened checkpoint, if the\n  clCkptCheckpointOpenAsync() was succesfull.\n\n  \\param error (in) return value of the clCkptCheckpointOpenAsync() call\n\n  \\retval  CL_OK The checkpoint is opened successfully.\n\n  \\retval  CL_ERR_NOT_EXIST \\c CL_CKPT_CHECKPOINT_CREATE flag is not set in creation flags and\n  the checkpoint does not exist.\n\n  \\retval CL_ERR_ALREADY_EXIST \\c CL_CKPT_CHECKPOINT_CREATE flag is set in creation flags but\n  the Checkpoint already exists and was originally created with different\n  attributes than specified by CheckpointCreation attributes.\n\n  \\retval  CL_ERR_TIMEOUT An implementation defined timeout occurred before the call\n  could complete.\n\n  \\retval  CL_ERR_TRY_AGAIN The service could not be provided at this time.\n  The process may try later.\n\n  \\retval  CL_ERR_NO_MEMORY Either the Checkpoint Service library or some other module of\n  Ckpt Service is out of memory. Thus service can not be provided at this time. This\n  may be a transient problem.\n\n  \\retval  CL_ERR_NO_RESOURCE Either the Checkpoint Service library or some other module\n  of Checkpoint Service is out of resources (other than memory). Thus, service can not be\n  provided at this time. This may be a transient problem.\n\n  \\par Description:\n  This CheckpointOpe callback function is getting called, when\n  clCkptCheckpointOpenAsync() call returns from the server. It carries the\n  invocation to identify the call and return code for indicating the status\n  of the call. If the retcode is CL_OK, then checkpoint handlE will be carrying\n  the proper handle of the checkpoint which was opened on the particular\n  invocation.\n\n  \\par Library File:\n  ClCkpt\n\n  \\sa clCkptCheckpointOpenAsync()\n"]
pub type ClCkptCheckpointOpenCallbackT = ::std::option::Option<
    unsafe extern "C" fn(invocation: ClInvocationT, checkpointHandle: ClCkptHdlT, error: ClRcT),
>;
#[doc = "  \\brief This function gets called When clCkptCheckpointSynchronizeAsync() call\n   returns on the server.\n\n  \\par Header File:\n  clCkptApi.h\n\n  \\param invocation (in) invocation value of the call. This is basically an\n  identification about the call.\n\n  \\param error (in) return value of the clCkptCheckpointSynchronizeAsync() call\n\n  \\retval  CL_OK The checkpoint is opened successfully.\n\n  \\retval  CL_ERR_TIMEOUT An implementation defined timeout occurred before the call\n  could complete.\n\n  \\retval  CL_ERR_TRY_AGAIN The service could not be provided at this time.\n  The process may try later.\n\n  \\retval  CL_ERR_NO_MEMORY Either the Checkpoint Service library or some other module of\n  Ckpt Service is out of memory. Thus service can not be provided at this time. This\n  may be a transient problem.\n\n  \\retval  CL_ERR_NO_RESOURCE Either the Checkpoint Service library or some other module\n  of Checkpoint Service is out of resources (other than memory). Thus, service can not be\n  provided at this time. This may be a transient problem.\n\n  \\par Description:\n  Applications which use asynchronous checkpoint option will be notified about the asynchronous\n  write or open status with a callback. If any problem occurs with the asynchronous write,\n  the application asks checkpointing to synchronize all the replicas. This is an\n  asynchronous call. So the applications can register another optional callback which will enable\n  them to know the status of 'synchronize-all-replicas' call.\n\n  \\par Library File:\n  ClCkpt\n\n  \\sa clCkptCheckpointSynchronizeAsync()\n"]
pub type ClCkptCheckpointSynchronizeCallbackT =
    ::std::option::Option<unsafe extern "C" fn(invocation: ClInvocationT, error: ClRcT)>;
#[doc = "  This structure is the only location where all the callbacks converge."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ClCkptCallbacksT {
    #[doc = "  Asynchronous open callback."]
    pub checkpointOpenCallback: ClCkptCheckpointOpenCallbackT,
    #[doc = " Synchronize callback."]
    pub checkpointSynchronizeCallback: ClCkptCheckpointSynchronizeCallbackT,
}
#[test]
fn bindgen_test_layout_ClCkptCallbacksT() {
    const UNINIT: ::std::mem::MaybeUninit<ClCkptCallbacksT> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ClCkptCallbacksT>(),
        16usize,
        concat!("Size of: ", stringify!(ClCkptCallbacksT))
    );
    assert_eq!(
        ::std::mem::align_of::<ClCkptCallbacksT>(),
        8usize,
        concat!("Alignment of ", stringify!(ClCkptCallbacksT))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).checkpointOpenCallback) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCkptCallbacksT),
            "::",
            stringify!(checkpointOpenCallback)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).checkpointSynchronizeCallback) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCkptCallbacksT),
            "::",
            stringify!(checkpointSynchronizeCallback)
        )
    );
}
extern "C" {
